import java.util.Scanner;
/*
Напишите класс, который принимает с клавиатуры две пары целых чисел:
• первая пара - значение и порядковый номер одного члена 
арифметической прогрессии;
• вторая пара - значение и порядковый номер другого члена этой
же прогрессии.
Класс должен вывести на экран все члены этой арифметической 
прогрессии, расположенные между двумя введенными.
В случае если речь идет о двух соседних членах, 
на экран следует вывести соответствующее текстовое сообщение. 


*/
public class K1328{
	static Scanner scanner = new Scanner(System.in);
	
}