import java.util.Scanner;

/**
Напишите класс, который принимает с клавиатуры целое 
положительное число х. Класс должен найти наименьшее целое положительное
двузначное число, сумма цифр которого равна х.
Если такого двузначного числа не существует, следует 
вывести на экран соответствующее текстовое сообщение. 

*/
		public class K1537{
	public static void main(String[] args) {

		Scanner scanner = new Scanner(System.in);
		System.out.println("enter number x");
		int x = scanner.nextInt();

	}

		}